---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.PointLoadNotOverlappingHost
source: html/b7daa16c-1d23-d38c-5b85-85ed19688d16.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.PointLoadNotOverlappingHost Property

Point load is not overlapping with its entire distribution its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId PointLoadNotOverlappingHost { get; }
```